/// totalArticles : 41436
/// articles : [{"title":"شاهد شباب إفطار المطرية مع رئيس الوزراء فى صورة واحدة بشعار \"شكرا للجهد المبذول\"","description":"قدم تليفزيون اليوم السابع تغطية خاصة حول استقبال الدكتور مصطفى مدبولي، رئيس مجلس الوزراء، اليوم بمقر مجلس الوزراء بالعاصمة الإدارية الجديدة، أعضاء فريق التنظيم الخاص بحفل \"إفطار 15 رمضان في المطرية\".","content":"كتبت _أمانى الأخرس\nقدم تليفزيون اليوم السابع تغطية خاصة حول استقبال الدكتور مصطفى مدبولي، رئيس مجلس الوزراء، اليوم بمقر مجلس الوزراء بالعاصمة الإدارية الجديدة، أعضاء فريق التنظيم الخاص بحفل \"إفطار 15 رمضان في المطرية\" بمحافظة القاهرة، الذي تمت إقامته... [1928 chars]","url":"https://www.youm7.com/story/2024/3/27/%D8%B4%D8%A7%D9%87%D8%AF-%D8%B4%D8%A8%D8%A7%D8%A8-%D8%A5%D9%81%D8%B7%D8%A7%D8%B1-%D8%A7%D9%84%D9%85%D8%B7%D8%B1%D9%8A%D8%A9-%D9%85%D8%B9-%D8%B1%D8%A6%D9%8A%D8%B3-%D8%A7%D9%84%D9%88%D8%B2%D8%B1%D8%A7%D8%A1-%D9%81%D9%89-%D8%B5%D9%88%D8%B1%D8%A9-%D9%88%D8%A7%D8%AD%D8%AF%D8%A9/6526397","image":"https://img.youm7.com/xlarge/202403270910121012.jpg","publishedAt":"2024-03-27T19:48:00Z","source":{"name":"اليوم السابع","url":"https://www.youm7.com"}},{"title":"أخبار مصر.. رئيس الوزراء: تسلم الدفعة الثانية من مستحقات رأس الحكمة خلال أسابيع","description":"نشر اليوم السابع خلال الساعات الأخيرة الماضية مجموعة من الاخبار الهامة على رأسها تأكيد الدكتور مصطفى مدبولي أن الحكومة، بمختلف وزاراتها، تعمل حاليا على تنفيذ التزاماتها المختلفة.","content":"نشر اليوم السابع خلال الساعات الأخيرة الماضية مجموعة من الاخبار الهامة على رأسها تأكيد الدكتور مصطفى مدبولي أن الحكومة، بمختلف وزاراتها، تعمل حاليا على تنفيذ التزاماتها المختلفة، في مشروع تطوير وتنمية مدينة رأس الحكمة، من خلال تيسير الإجراءات وتذليل ... [5889 chars]","url":"https://www.youm7.com/story/2024/3/27/%D8%A3%D8%AE%D8%A8%D8%A7%D8%B1-%D9%85%D8%B5%D8%B1-%D8%B1%D8%A6%D9%8A%D8%B3-%D8%A7%D9%84%D9%88%D8%B2%D8%B1%D8%A7%D8%A1-%D8%AA%D8%B3%D9%84%D9%85-%D8%A7%D9%84%D8%AF%D9%81%D8%B9%D8%A9-%D8%A7%D9%84%D8%AB%D8%A7%D9%86%D9%8A%D8%A9-%D9%85%D9%86-%D9%85%D8%B3%D8%AA%D8%AD%D9%82%D8%A7%D8%AA-%D8%B1%D8%A3%D8%B3/6526217","image":"https://img.youm7.com/xlarge/202402230458125812.jpg","publishedAt":"2024-03-27T16:00:00Z","source":{"name":"اليوم السابع","url":"https://www.youm7.com"}},{"title":"رئيس الوزراء: حفل \"إفطار 15 رمضان في المطرية\" يعبر عن روح تعاون المصريين","description":"استقبل الدكتور مصطفى مدبولي، رئيس مجلس الوزراء، اليوم بمقر مجلس الوزراء بالعاصمة الإدارية الجديدة، أعضاء فريق تنظيم حفل \"إفطار 15 رمضان في المطرية\"","content":"كتبت هند مختار\nاستقبل الدكتور مصطفى مدبولي، رئيس مجلس الوزراء، اليوم بمقر مجلس الوزراء بالعاصمة الإدارية الجديدة، أعضاء فريق تنظيم حفل \"إفطار 15 رمضان في المطرية\" بمحافظة القاهرة، الذي تمت إقامته أمس الأول للعام العاشر على التوالي، وذلك بحضور الدكتور... [2201 chars]","url":"https://www.youm7.com/story/2024/3/27/%D8%B1%D8%A6%D9%8A%D8%B3-%D8%A7%D9%84%D9%88%D8%B2%D8%B1%D8%A7%D8%A1-%D8%AD%D9%81%D9%84-%D8%A5%D9%81%D8%B7%D8%A7%D8%B1-15-%D8%B1%D9%85%D8%B6%D8%A7%D9%86-%D9%81%D9%8A-%D8%A7%D9%84%D9%85%D8%B7%D8%B1%D9%8A%D8%A9-%D9%8A%D8%B9%D8%A8%D8%B1-%D8%B9%D9%86/6526242","image":"https://img.youm7.com/xlarge/20240327060212212.jpg","publishedAt":"2024-03-27T15:57:00Z","source":{"name":"اليوم السابع","url":"https://www.youm7.com"}},{"title":"مصر.. حريق هائل وانفجارات بمحطات صرف صحي جراء \"تسرب بترولي\"","description":"وقع حريق هائل جراء انفجارات متتالية في محطات للصرف الصحي في نطاق القاهرة، الأربعاء، نتيجة تسرب بترولي إليها، حسبما أفاد مسؤولون مصريون.","content":"(CNN)-- وقع حريق هائل جراء انفجارات متتالية في محطات للصرف الصحي في نطاق القاهرة، الأربعاء، نتيجة تسرب بترولي إليها، حسبما أفاد مسؤولون مصريون.\nوأرجعت شركة الصرف الصحي بالقاهرة الكبرى الحادثة إلى \"تسرب مواد بترولية إلى نفق الصرف الصحي أدى إلى إشعال ح... [950 chars]","url":"https://arabic.cnn.com/middle-east/article/2024/03/27/egypt-massive-fire-explosions-at-sewage-plants-oil-leak","image":"https://cnn-arabic-images.cnn.io/cloudinary/image/upload/w_1920,h_1008,c_fill,q_auto,g_center/t_cnnarabic_watermark_logo_v5/cnnarabic/2024/03/27/images/264721.jpg","publishedAt":"2024-03-27T15:29:51Z","source":{"name":"CNN Arabic","url":"https://arabic.cnn.com"}},{"title":"\"تخصص سيدات\".. سجل حافل بالشكاوى ضد سائق أوبر المتهم فى قضية حبيبة الشماع","description":"كشفت تحقيقات النيابة العامة مع السائق المتهم بمحاولة خطف حبيبة الشماع \"فتاة الشروق\"، عن العديد من كواليس الواقعة.","content":"كتب أحمد حسني\nكشفت تحقيقات النيابة العامة مع السائق المتهم بمحاولة خطف حبيبة الشماع \"فتاة الشروق\"، عن العديد من كواليس الواقعة.\nوأوضحت التحقيقات أن السائق المتهم تلقى العديد من الشكاوي جميعها من سيدات خلال عمله بشركة \"أوبر\"، وتعددت الشكاوي ما بين تعا... [2149 chars]","url":"https://www.youm7.com/story/2024/3/27/%D8%AA%D8%AE%D8%B5%D8%B5-%D8%B3%D9%8A%D8%AF%D8%A7%D8%AA-%D8%B3%D8%AC%D9%84-%D8%AD%D8%A7%D9%81%D9%84-%D8%A8%D8%A7%D9%84%D8%B4%D9%83%D8%A7%D9%88%D9%89-%D8%B6%D8%AF-%D8%B3%D8%A7%D8%A6%D9%82-%D8%A3%D9%88%D8%A8%D8%B1-%D8%A7%D9%84%D9%85%D8%AA%D9%87%D9%85-%D9%81%D9%89/6525515","image":"https://img.youm7.com/xlarge/20240314053100310.jpg","publishedAt":"2024-03-27T13:23:00Z","source":{"name":"اليوم السابع","url":"https://www.youm7.com"}},{"title":"السنغاليون يتساءلون عن السيدة الأولى لرئيس يجمع بين زوجتين.. فيديوجراف","description":"أسفرت الانتخابات الرئاسية فى السنغال عن فوز مرشح المعارضة باسيرو ديوماى فاي، حيث أعلن الائتلاف الحاكم فى السنغال رسميا فوزه، وهنأ الرئيس المنتهية ولايته ماكى سال..","content":"كتبت: إسراء أحمد فؤاد\nأسفرت الانتخابات الرئاسية فى السنغال عن فوز مرشح المعارضة باسيرو ديوماى فاي، حيث أعلن الائتلاف الحاكم فى السنغال رسميا فوزه، وهنأ الرئيس المنتهية ولايته ماكى سال، الرئيس الجديد من الجولة الأولى معتبرا ذلك فوزا للديمقراطية السنغا... [969 chars]","url":"https://www.youm7.com/story/2024/3/27/%D8%A7%D9%84%D8%B3%D9%86%D8%BA%D8%A7%D9%84%D9%8A%D9%88%D9%86-%D9%8A%D8%AA%D8%B3%D8%A7%D8%A1%D9%84%D9%88%D9%86-%D8%B9%D9%86-%D8%A7%D9%84%D8%B3%D9%8A%D8%AF%D8%A9-%D8%A7%D9%84%D8%A3%D9%88%D9%84%D9%89-%D9%84%D8%B1%D8%A6%D9%8A%D8%B3-%D9%8A%D8%AC%D9%85%D8%B9-%D8%A8%D9%8A%D9%86-%D8%B2%D9%88%D8%AC%D8%AA%D9%8A%D9%86-%D9%81%D9%8A%D8%AF%D9%8A%D9%88%D8%AC%D8%B1%D8%A7%D9%81/6526035","image":"https://img.youm7.com/xlarge/2024032703040343.jpg","publishedAt":"2024-03-27T13:22:00Z","source":{"name":"اليوم السابع","url":"https://www.youm7.com"}},{"title":"حوار ميسي: سألعب كرة القدم لأطول فترة.. ولم أرغب في الرحيل عن برشلونة","description":"شدد ليونيل ميسي نجم منتخب الأرجنتين وفريق إنتر ميامي الأمريكي على أنه يحاول الاهتمام بنفسه جيدا حتى يستطيع لعب كرة القدم في أعلى مستوى رغم تقدمه في ال","content":"شدد ليونيل ميسي نجم منتخب الأرجنتين وفريق إنتر ميامي الأمريكي على أنه يحاول الاهتمام بنفسه جيدا حتى يستطيع لعب كرة القدم في أعلى مستوى رغم تقدمه في العمر.\nليونيل ميسي النادي : إنتر ميامي الأرجنتين\nوقال ميسي في حوار عبر قناة إم بي سي: \"دائما ما أحاول ... [2520 chars]","url":"https://www.filgoal.com/articles/480254","image":"https://media.filgoal.com/news/verylarge/340911_0.jpg","publishedAt":"2024-03-27T10:32:00Z","source":{"name":"FilGoal.com","url":"https://www.filgoal.com"}},{"title":"انخفاض سعر الدولار أمام الجنيه المصرى بمنتصف التعاملات","description":"انخفض سعر الدولار أمام الجنيه المصرى، بمنتصف التعاملات في البنوك المصرية، مسجلا في البنك الأهلى المصرى 47.30 للشراء، 47.40 جنيه للبيع.","content":"كتبت ريهام الباشا\nانخفض سعر الدولار أمام الجنيه المصرى، بمنتصف التعاملات في البنوك المصرية، مسجلا في البنك الأهلى المصرى 47.30 للشراء، 47.40 جنيه للبيع، مقابل سعره صباحا كان بـ47.73 للشراء، 47.83 جنيه للبيع، أما فى بنك مصر سجل 47.32 جنيه للشراء، 47.4... [835 chars]","url":"https://www.youm7.com/story/2024/3/27/%D8%A7%D9%86%D8%AE%D9%81%D8%A7%D8%B6-%D8%B3%D8%B9%D8%B1-%D8%A7%D9%84%D8%AF%D9%88%D9%84%D8%A7%D8%B1-%D8%A3%D9%85%D8%A7%D9%85-%D8%A7%D9%84%D8%AC%D9%86%D9%8A%D9%87-%D8%A7%D9%84%D9%85%D8%B5%D8%B1%D9%89-%D8%A8%D9%85%D9%86%D8%AA%D8%B5%D9%81-%D8%A7%D9%84%D8%AA%D8%B9%D8%A7%D9%85%D9%84%D8%A7%D8%AA/6525580","image":"https://img.youm7.com/xlarge/202209080330533053.jpg","publishedAt":"2024-03-27T10:16:00Z","source":{"name":"اليوم السابع","url":"https://www.youm7.com"}},{"title":"صرف صحى القاهرة الكبرى: تسرب مواد بترولية سبب إشعال حرائق بخمس مواقع تابعة للشركة","description":"أعلنت شركة الصرف الصحى بالقاهرة أنه حدث تسرب مواد بترولية إلى نفق الصرف الصحى أدى إلى إشعال حرائق بخمس مواقع تابعة للشركة.","content":"كتب سيد الخلفاوى\nأعلنت شركة الصرف الصحى بالقاهرة، أنه حدث تسرب مواد بترولية إلى نفق الصرف الصحى أدى إلى نشوب حرائق بخمس مواقع تابعة للشركة فى محطتى القلج والخصوص وغرف الاتصال بينهما.\nو تم السيطرة على الحرائق بالتعاون مع الدفاع المدنى ولا توجد أى خسائ... [509 chars]","url":"https://www.youm7.com/story/2024/3/27/%D8%B5%D8%B1%D9%81-%D8%B5%D8%AD%D9%89-%D8%A7%D9%84%D9%82%D8%A7%D9%87%D8%B1%D8%A9-%D8%A7%D9%84%D9%83%D8%A8%D8%B1%D9%89-%D8%AA%D8%B3%D8%B1%D8%A8-%D9%85%D9%88%D8%A7%D8%AF-%D8%A8%D8%AA%D8%B1%D9%88%D9%84%D9%8A%D8%A9-%D8%B3%D8%A8%D8%A8-%D8%A5%D8%B4%D8%B9%D8%A7%D9%84-%D8%AD%D8%B1%D8%A7%D8%A6%D9%82/6525660","image":"https://img.youm7.com/xlarge/202403271147394739.jpg","publishedAt":"2024-03-27T09:34:00Z","source":{"name":"اليوم السابع","url":"https://www.youm7.com"}},{"title":"ياسين بنزية يسجل هدفا عالميا مع الجزائر ضد جنوب أفريقيا ويقترب من \"بوشكاش\"","description":"سجل ياسين بنزية نجم منتخب الجزائر ولاعب فريق كارباج أجدام الأذربيجاني هدفا عالميا، في تعادل محاربي الصحراء مع منتخب جنوب أفريقيا.","content":"كتب أحمد حربى\nسجل ياسين بنزية نجم منتخب الجزائر ولاعب فريق كارباج أجدام الأذربيجاني هدفا عالميا، في تعادل محاربي الصحراء مع منتخب جنوب أفريقيا بنتيجة 3-3 في المباراة التي جمعت المنتخبين على ملعب نيلسون مانديلا مساء أمس الثلاثاء في إطار استعدادات المن... [2216 chars]","url":"https://www.youm7.com/story/2024/3/27/%D9%8A%D8%A7%D8%B3%D9%8A%D9%86-%D8%A8%D9%86%D8%B2%D9%8A%D8%A9-%D9%8A%D8%B3%D8%AC%D9%84-%D9%87%D8%AF%D9%81%D8%A7-%D8%B9%D8%A7%D9%84%D9%85%D9%8A%D8%A7-%D9%85%D8%B9-%D8%A7%D9%84%D8%AC%D8%B2%D8%A7%D8%A6%D8%B1-%D8%B6%D8%AF-%D8%AC%D9%86%D9%88%D8%A8-%D8%A3%D9%81%D8%B1%D9%8A%D9%82%D9%8A%D8%A7/6525608","image":"https://img.youm7.com/xlarge/2024032711040848.jpg","publishedAt":"2024-03-27T09:22:00Z","source":{"name":"اليوم السابع","url":"https://www.youm7.com"}}]

class ApiGnews {
  ApiGnews({
      this.totalArticles, 
      this.articles,});

  ApiGnews.fromJson(dynamic json) {
    totalArticles = json['totalArticles'];
    if (json['articles'] != null) {
      articles = [];
      json['articles'].forEach((v) {
        articles?.add(Articles.fromJson(v));
      });
    }
  }
  int? totalArticles;
  List<Articles>? articles;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['totalArticles'] = totalArticles;
    if (articles != null) {
      map['articles'] = articles?.map((v) => v.toJson()).toList();
    }
    return map;
  }

}

/// title : "شاهد شباب إفطار المطرية مع رئيس الوزراء فى صورة واحدة بشعار \"شكرا للجهد المبذول\""
/// description : "قدم تليفزيون اليوم السابع تغطية خاصة حول استقبال الدكتور مصطفى مدبولي، رئيس مجلس الوزراء، اليوم بمقر مجلس الوزراء بالعاصمة الإدارية الجديدة، أعضاء فريق التنظيم الخاص بحفل \"إفطار 15 رمضان في المطرية\"."
/// content : "كتبت _أمانى الأخرس\nقدم تليفزيون اليوم السابع تغطية خاصة حول استقبال الدكتور مصطفى مدبولي، رئيس مجلس الوزراء، اليوم بمقر مجلس الوزراء بالعاصمة الإدارية الجديدة، أعضاء فريق التنظيم الخاص بحفل \"إفطار 15 رمضان في المطرية\" بمحافظة القاهرة، الذي تمت إقامته... [1928 chars]"
/// url : "https://www.youm7.com/story/2024/3/27/%D8%B4%D8%A7%D9%87%D8%AF-%D8%B4%D8%A8%D8%A7%D8%A8-%D8%A5%D9%81%D8%B7%D8%A7%D8%B1-%D8%A7%D9%84%D9%85%D8%B7%D8%B1%D9%8A%D8%A9-%D9%85%D8%B9-%D8%B1%D8%A6%D9%8A%D8%B3-%D8%A7%D9%84%D9%88%D8%B2%D8%B1%D8%A7%D8%A1-%D9%81%D9%89-%D8%B5%D9%88%D8%B1%D8%A9-%D9%88%D8%A7%D8%AD%D8%AF%D8%A9/6526397"
/// image : "https://img.youm7.com/xlarge/202403270910121012.jpg"
/// publishedAt : "2024-03-27T19:48:00Z"
/// source : {"name":"اليوم السابع","url":"https://www.youm7.com"}

class Articles {
  Articles({
      this.title, 
      this.description, 
      this.content, 
      this.url, 
      this.image, 
      this.publishedAt, 
      this.source,});

  Articles.fromJson(dynamic json) {
    title = json['title'];
    description = json['description'];
    content = json['content'];
    url = json['url'];
    image = json['image'];
    publishedAt = json['publishedAt'];
    source = json['source'] != null ? Source.fromJson(json['source']) : null;
  }
  String? title;
  String? description;
  String? content;
  String? url;
  String? image;
  String? publishedAt;
  Source? source;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['title'] = title;
    map['description'] = description;
    map['content'] = content;
    map['url'] = url;
    map['image'] = image;
    map['publishedAt'] = publishedAt;
    if (source != null) {
      map['source'] = source?.toJson();
    }
    return map;
  }

}

/// name : "اليوم السابع"
/// url : "https://www.youm7.com"

class Source {
  Source({
      this.name, 
      this.url,});

  Source.fromJson(dynamic json) {
    name = json['name'];
    url = json['url'];
  }
  String? name;
  String? url;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['name'] = name;
    map['url'] = url;
    return map;
  }

}